app/views/localities/_form.html.erb

SELECT "registration_numbers".* FROM "registration_numbers"
---
    <%= f.label :registration_id %><br>
    <%= f.collection_select :registration_id, RegistrationNumber.all, :id, :name, prompt: "Select" %>