app/views/registration_numbers/_form.html.erb

    <%= f.label :state_id %><br>
    <%= f.collection_select :state_id, State.all, :id, :name,prompt: "Select State" %>
---
SELECT "states".* FROM "states"