app/controllers/api/v1/registration_numbers_controller.rb

SELECT  "registration_numbers".* FROM "registration_numbers" WHERE "registration_numbers"."name" = ? LIMIT 1  [["name", "1"]]
UPDATE "users" SET "request_limit" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["request_limit", 99], ["updated_at", "2016-11-16 15:34:41.757391"], ["id", 3]]
---
			def index
				if !@user.nil?
					#access_token = params[:access_token]
					#reg_no = params[:reg_no]
                   @registration_number = RegistrationNumber.find_by_name(params[:reg_no])
                   @user.update_attributes(request_limit: @user.request_limit - 1)