app/controllers/api/v1/states_controller.rb

			def index
				if !@user.nil?
                   @state = State.find_by_name(params[:state])
                   @user.update_attributes(request_limit: @user.request_limit - 1)
---
SELECT  "states".* FROM "states" WHERE "states"."name" = ? LIMIT 1  [["name", "Karnataka"]]
UPDATE "users" SET "request_limit" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["request_limit", 95], ["updated_at", "2016-11-17 09:21:15.869227"], ["id", 3]]