app/controllers/localities_controller.rb

  def index
    @localities = Locality.all
---
SELECT "localities".* FROM "localities"

  def create
    @locality = Locality.new(locality_params)

    respond_to do |format|
      if @locality.save
---
INSERT INTO "localities" ("name", "registration_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Basvangudi"], ["registration_id", 3], ["created_at", "2016-11-16 18:51:40.259542"], ["updated_at", "2016-11-16 18:51:40.259542"]]

    def set_locality
      @locality = Locality.find(params[:id])
---
SELECT  "localities".* FROM "localities" WHERE "localities"."id" = ? LIMIT 1  [["id", 1]]