app/controllers/registration_numbers_controller.rb

  def index
    @registration_numbers = RegistrationNumber.all
---
SELECT "registration_numbers".* FROM "registration_numbers"

  def create
    @registration_number = RegistrationNumber.new(registration_number_params)

    respond_to do |format|
      if @registration_number.save
---
INSERT INTO "registration_numbers" ("name", "state_id", "office", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Kadapa"], ["state_id", 1], ["office", "Durga"], ["created_at", "2016-11-16 14:03:08.608201"], ["updated_at", "2016-11-16 14:03:08.608201"]]

  def update
    respond_to do |format|
      if @registration_number.update(registration_number_params)
---
UPDATE "registration_numbers" SET "name" = ?, "office" = ?, "updated_at" = ? WHERE "registration_numbers"."id" = ?  [["name", "pry"], ["office", "kadapa"], ["updated_at", "2016-11-16 15:36:40.752197"], ["id", 1]]

  def destroy
    @registration_number.destroy
---
DELETE FROM "registration_numbers" WHERE "registration_numbers"."id" = ?  [["id", 1]]

    def set_registration_number
      @registration_number = RegistrationNumber.find(params[:id])
---
SELECT  "registration_numbers".* FROM "registration_numbers" WHERE "registration_numbers"."id" = ? LIMIT 1  [["id", 1]]