app/controllers/states_controller.rb

INSERT INTO "states" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "AndhraPradesh"], ["created_at", "2016-11-16 14:02:23.974648"], ["updated_at", "2016-11-16 14:02:23.974648"]]
---
  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save

DELETE FROM "states" WHERE "states"."id" = ?  [["id", 1]]
---
  def destroy
    @state.destroy

SELECT  "states".* FROM "states" WHERE "states"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_state
      @state = State.find(params[:id])